# IfcExportPredefinedtypeType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..IfcExportPredefinedtypeType Property
ParameterTypeId Class See Also
---
"Type IFC Predefined Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId IfcExportPredefinedtypeType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IfcExportPredefinedtypeType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ IfcExportPredefinedtypeType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace